#pragma once


#define MOBULENAME_ProjectLH                      "ProjectLH.exe"        



#pragma region//---------------------------------------------------------------------------------------------特征分组: UE4CodeGen_Private





//-------------------------------------------------------------------------------------------2022-06-12 12:50:57
//所属分组: UE4CodeGen_Private
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UE4CodeGen_Private$ConstructUClass       0x00000000015F50E0



//-------------------------------------------------------------------------------------------2022-06-12 12:50:57
//所属分组: UE4CodeGen_Private
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UE4CodeGen_Private$ConstructUEnum        0x00000000015F5340



//-------------------------------------------------------------------------------------------2022-06-12 12:50:57
//所属分组: UE4CodeGen_Private
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UE4CodeGen_Private$ConstructUFunction    0x00000000015F57C0



//-------------------------------------------------------------------------------------------2022-06-12 12:50:57
//所属分组: UE4CodeGen_Private
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UE4CodeGen_Private$ConstructUPackage     0x00000000015F5B20



//-------------------------------------------------------------------------------------------2022-06-12 12:50:57
//所属分组: UE4CodeGen_Private
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UE4CodeGen_Private$ConstructUProperty    0x00000000015F5C30



//-------------------------------------------------------------------------------------------2022-06-12 12:50:57
//所属分组: UE4CodeGen_Private
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UE4CodeGen_Private$ConstructUScriptStruct 0x00000000015F7790







#pragma endregion

#pragma region//---------------------------------------------------------------------------------------------特征分组: FMemory




//-------------------------------------------------------------------------------------------2022-06-12 12:49:53
//所属分组: FMemory
//默认模块: ProjectLH.exe
//数据类型: 符号
#define FMemory$Free                             0x000000000138F210





#pragma endregion

#pragma region//---------------------------------------------------------------------------------------------特征分组: FName





//-------------------------------------------------------------------------------------------2022-06-12 12:50:18
//所属分组: FName
//默认模块: ProjectLH.exe
//数据类型: 符号
#define FName$FName                              0x000000000145FA70



//-------------------------------------------------------------------------------------------2022-06-12 12:50:18
//所属分组: FName
//默认模块: ProjectLH.exe
//数据类型: 变量
#define FNamePool$NamePoolData                   0x0000000004CF9840



//-------------------------------------------------------------------------------------------2022-06-12 12:50:18
//所属分组: FName
//默认模块: ProjectLH.exe
//数据类型: 符号
#define FName$ToString                           0x000000000146B4F0






#pragma endregion

#pragma region//---------------------------------------------------------------------------------------------特征分组: FText





//-------------------------------------------------------------------------------------------2022-06-12 12:50:30
//所属分组: FText
//默认模块: ProjectLH.exe
//数据类型: 符号
#define FText$ToString                           0x00000000013AACB0









#pragma endregion

#pragma region//---------------------------------------------------------------------------------------------特征分组: UE4Callback





//-------------------------------------------------------------------------------------------2022-06-12 12:50:40
//所属分组: UE4Callback
//默认模块: ProjectLH.exe
//数据类型: 函数
#define FWindowsApplication$AppWndProc            0x0000000001653670



//-------------------------------------------------------------------------------------------2022-06-12 12:50:40
//所属分组: UE4Callback
//默认模块: ProjectLH.exe
//数据类型: 函数
#define FNativeFunctionRegistrar$RegisterFunctions 0x00000000014DF870




#pragma endregion

#pragma region//---------------------------------------------------------------------------------------------特征分组: UE4Core




//-------------------------------------------------------------------------------------------2022-06-12 12:51:10
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 函数
#define GetPrivateStaticClassBody                0x00000000014D7EF0



//-------------------------------------------------------------------------------------------2022-06-12 12:51:10
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 符号
#define GuardedMainWrapper                       0x000000000031C390



//-------------------------------------------------------------------------------------------2022-06-12 12:51:10
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 变量
#define UE4$GUObjectArray                        0x0000000004D11060



//-------------------------------------------------------------------------------------------2022-06-12 12:51:10
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 变量
#define UE4$GWorld                               0x0000000004DF96E8



//-------------------------------------------------------------------------------------------2022-06-12 12:51:10
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 地址
#define TEXTSectionEND                           0x0000000003287D73



//-------------------------------------------------------------------------------------------2022-06-12 12:51:10
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UObjectCompiledInDefer                   0x000000000160BED0


//-------------------------------------------------------------------------------------------2022-06-18 14:49:28
//所属分组: UE4Core
//默认模块: ProjectLH.exe
//数据类型: 变量
#define FSlateApplication$CurrentApplication     0x0000000004D1E608






#pragma endregion






#pragma region//---------------------------------------------------------------------------------------------特征分组: UObject



//-------------------------------------------------------------------------------------------2022-06-12 12:51:24
//所属分组: UObject
//默认模块: ProjectLH.exe
//数据类型: 函数
#define UObject$ProcessEvent                     0x0000000001602630



//-------------------------------------------------------------------------------------------2022-06-12 12:51:24
//所属分组: UObject
//默认模块: ProjectLH.exe
//数据类型: 符号
#define UObject$UObject$Void                     0x00000000015F09D0



//-------------------------------------------------------------------------------------------2022-06-12 12:51:24
//所属分组: UObject
//默认模块: ProjectLH.exe
//数据类型: 符号
#define UObject$UObject$FObjectInitializer       0x00000000015F0970



#pragma endregion





#pragma region//---------------------------------------------------------------------------------------------特征分组: SWindow



//-------------------------------------------------------------------------------------------2022-06-18 17:00:48
//所属分组: SWindow
//默认模块: ProjectLH.exe
//数据类型: 符号
#define SWindow$ToString                         0x00000000016FFEB0





#pragma endregion


